# grupo 7

# Assignment 2

### Exercise 1: Basic Dictionary Creation and Access
Objective: Create a dictionary named student_info containing at least three key-value pairs where keys are student names (as strings) and values are their respective ages (as integers). Then, access and print the age of a specific student.

In [13]:
# En primer lugar, se crea un diccionario con las edades de cuatro estudiantes.

In [23]:
estudiantes_informacion = {"Luis Aviles": 20,"Renato Contreras": 18,"Melisa Cardenas": 19,"Fernanda Rios": 21}

In [15]:
# En segundo lugar, se ejecuta la edad de un estudiante en específico. Como lo puede ser Fernanda Rios o Luis Áviles.

In [22]:
print (estudiantes_informacion["Fernanda Rios"])

21

In [24]:
print (estudiantes_informacion["Luis Aviles"])

20

### Exercise 2: Modifying Dictionary Values
**Objective:** Start with a dictionary `product_prices` where keys are product names (strings) and values are their prices (floats). Select a product and update its price. Then, add a new product with its price to the dictionary.

In [30]:
# Initial product prices
product_prices = {"Laptop": 999.99,"Smartphone": 499.99,"Headphones": 89.99,"Camera": 279.99}

In [ ]:
# Modificaremos el precio del producto "Laptop"

In [31]:
product_prices["Laptop"] = 1100.50

In [32]:
# Comprobamos la modificación
print (product_prices)

{'Laptop': 1100.5, 'Smartphone': 499.99, 'Headphones': 89.99, 'Camera': 279.99}

In [33]:
# Además, agregaremos un producto con su precio al diccionario
product_prices["USB"] = 35.70

In [34]:
# Comprobamos
print (product_prices)

{'Laptop': 1100.5, 'Smartphone': 499.99, 'Headphones': 89.99, 'Camera': 279.99, 'USB': 35.7}

### Exercise 3: Dictionary Comprehension
**Objective:** Create a dictionary `squared_numbers` using dictionary comprehension where keys are integers from 1 to 10, and values are the squares of these keys.

In [35]:
# Se desarrolla el diccionario en un rango del 1 al 10. El código se coloca del 1 al 11, para que agarre hasta el 10 en su ejecución.
squared_numbers = {x: x**2 for x in range(1, 11)}

In [36]:
# Se comprueba/ejecuta el diccionario
print (squared_numbers)

{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81, 10: 100}

### Exercise 4: Nested Dictionaries
**Objective:** Create a nested dictionary `employee_data` where each key is an employee ID (integer) and each value is another dictionary with keys 'Name', 'Position', and 'Salary'. Then, access and print the name and position of a specific employee by their ID. This dictionary `employee_data` should have only 5 keys.

In [37]:
# Se crea el diccionario "employee_data"
employee_data = {
    1: {'Nombre': 'Renato', 'Posición': 'Asistente', 'Salario': 50000},
    2: {'Nombre': 'María', 'Posición': 'Productor', 'Salario': 70000},
    3: {'Nombre': 'Cristian', 'Posición': 'Fotógrafo', 'Salario': 55000},
    4: {'Nombre': 'Anna', 'Posición': 'Diseñador', 'Salario': 60000},
    5: {'Nombre': 'Gabriela', 'Posición': 'Director', 'Salario': 65000}
}

In [39]:
# Se ejecuta el id de un empleado en específico
print (employee_data[4])

{'Nombre': 'Anna', 'Posición': 'Diseñador', 'Salario': 60000}

### Exercise 5: Merging Dictionaries
**Objective:** You have two dictionaries `dict1` and `dict2` with non-overlapping keys. Merge these two dictionaries into a new dictionary `merged_dict` and print its contents. This `merged_dict` dict should have all the keys.

In [40]:
dict1 = {"A": 1, "B": 2, "C": 3}
dict2 = {"D": 4, "E": 5, "F": 6}

In [41]:
# Se unen ambos diccionarios con la función de desempaquetado
merged_dict = {**dict1, **dict2}

In [42]:
# Se comprueba la unión de ambos diccionarios
print(merged_dict)

{'A': 1, 'B': 2, 'C': 3, 'D': 4, 'E': 5, 'F': 6}

## Pandas

### Exercise 1: Selecting Single Column with .loc
**Objective**: Use .loc to select and print only the 'Name' column for all rows.

### Exercise 2: Row Slicing with .iloc
**Objective**: Use .iloc to select and print rows 2 through 4 (inclusive).

### Exercise 3: Selecting Multiple Columns with .iloc
**Objective**: Use .iloc to select and print the 'Name' and 'Age' columns for all rows.

### Exercise 4: Conditional Selection with .loc
**Objective**: Use .loc to select and print rows where the 'Age' is greater than 30.

### Exercise 5: Modifying Data with .loc
**Objective**: Use .loc to change the 'City' of the person named 'Alice' to 'Boston'. Then, print the updated DataFrame.

In [ ]:
# Creating a DataFrame for the exercise
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami']
}

### Exercise 1: Selecting Single Column with .loc

In [47]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami']
}

In [48]:
import pandas as pd
import numpy as np

In [49]:
data_df = pd.DataFrame(data)

In [50]:
data_df.loc[0:,["Name"]]

      Name
0    Alice
1      Bob
2  Charlie
3    David
4      Eva

### Exercise 2: Row Slicing with .iloc

In [51]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami']
}

In [54]:
data_df.iloc[2:5]

      Name  Age     City
2  Charlie   35  Chicago
3    David   40  Houston
4      Eva   45    Miami

### Exercise 3: Selecting Multiple Columns with .iloc

In [35]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami']
}

In [55]:
data_df.iloc[0:5, [0,1]]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
4      Eva   45

### Exercise 4: Conditional Selection with .loc

In [59]:
df = pd.DataFrame(data)

In [62]:
result = df.loc[df['Age'] > 30]

In [63]:
print(result)

      Name  Age     City
2  Charlie   35  Chicago
3    David   40  Houston
4      Eva   45    Miami

### Exercise 5: Modifying Data with .loc

In [64]:
import pandas as pd

In [65]:
df = pd.DataFrame(data)

In [66]:
#Se realiza la modificación con la operación log
df.loc[df['Name'] == 'Alice', 'City'] = 'Boston'

In [67]:
print(df)

      Name  Age         City
0    Alice   25       Boston
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45        Miami